In [4]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [5]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A -1.390351 -0.826697 -0.935881 -2.590610
B  0.442792  0.573708 -0.561990  0.436353
C  0.780341  0.481560 -0.002860 -0.002637
D  0.301389  0.226828  1.888257  0.205828
E -1.147226 -0.572476  1.928439 -1.697054

In [8]:
df >0

       W      X      Y      Z
A  False  False  False  False
B   True   True  False   True
C   True   True  False  False
D   True   True   True   True
E  False  False   True  False

In [9]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B  0.442792  0.573708       NaN  0.436353
C  0.780341  0.481560       NaN       NaN
D  0.301389  0.226828  1.888257  0.205828
E       NaN       NaN  1.928439       NaN

In [10]:
df['W']>0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [11]:
df[df['W']>0]

          W         X         Y         Z
B  0.442792  0.573708 -0.561990  0.436353
C  0.780341  0.481560 -0.002860 -0.002637
D  0.301389  0.226828  1.888257  0.205828

In [12]:
df[df['Z']<0]

          W         X         Y         Z
A -1.390351 -0.826697 -0.935881 -2.590610
C  0.780341  0.481560 -0.002860 -0.002637
E -1.147226 -0.572476  1.928439 -1.697054

In [13]:
resultdf= df[df['Z']<0]

In [28]:
resultdf

          W         X         Y         Z
A -1.390351 -0.826697 -0.935881 -2.590610
C  0.780341  0.481560 -0.002860 -0.002637
E -1.147226 -0.572476  1.928439 -1.697054

In [29]:
resultdf['X']

A   -0.826697
C    0.481560
E   -0.572476
Name: X, dtype: float64

In [30]:
df[df['Z']<0]['X']

A   -0.826697
C    0.481560
E   -0.572476
Name: X, dtype: float64

In [31]:
df[df['Z']<0][['X','Y']]

          X         Y
A -0.826697 -0.935881
C  0.481560 -0.002860
E -0.572476  1.928439

In [35]:
boolser = df['W']>0
df

          W         X         Y         Z
A -1.390351 -0.826697 -0.935881 -2.590610
B  0.442792  0.573708 -0.561990  0.436353
C  0.780341  0.481560 -0.002860 -0.002637
D  0.301389  0.226828  1.888257  0.205828
E -1.147226 -0.572476  1.928439 -1.697054

In [36]:
boolser

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

result = df[boolser]

result

In [37]:
df[df['W']>0]

          W         X         Y         Z
B  0.442792  0.573708 -0.561990  0.436353
C  0.780341  0.481560 -0.002860 -0.002637
D  0.301389  0.226828  1.888257  0.205828

In [39]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
D  0.301389  0.226828  1.888257  0.205828

In [41]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
B  0.442792  0.573708 -0.561990  0.436353
C  0.780341  0.481560 -0.002860 -0.002637
D  0.301389  0.226828  1.888257  0.205828
E -1.147226 -0.572476  1.928439 -1.697054

In [42]:
df

          W         X         Y         Z
A -1.390351 -0.826697 -0.935881 -2.590610
B  0.442792  0.573708 -0.561990  0.436353
C  0.780341  0.481560 -0.002860 -0.002637
D  0.301389  0.226828  1.888257  0.205828
E -1.147226 -0.572476  1.928439 -1.697054

In [43]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.390351 -0.826697 -0.935881 -2.590610
1     B  0.442792  0.573708 -0.561990  0.436353
2     C  0.780341  0.481560 -0.002860 -0.002637
3     D  0.301389  0.226828  1.888257  0.205828
4     E -1.147226 -0.572476  1.928439 -1.697054

In [44]:
df

          W         X         Y         Z
A -1.390351 -0.826697 -0.935881 -2.590610
B  0.442792  0.573708 -0.561990  0.436353
C  0.780341  0.481560 -0.002860 -0.002637
D  0.301389  0.226828  1.888257  0.205828
E -1.147226 -0.572476  1.928439 -1.697054

In [46]:
newind='CA NY WY OR CO'.split()

In [47]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [48]:
df['States']=newind

In [49]:
df

          W         X         Y         Z States
A -1.390351 -0.826697 -0.935881 -2.590610     CA
B  0.442792  0.573708 -0.561990  0.436353     NY
C  0.780341  0.481560 -0.002860 -0.002637     WY
D  0.301389  0.226828  1.888257  0.205828     OR
E -1.147226 -0.572476  1.928439 -1.697054     CO

In [50]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.390351 -0.826697 -0.935881 -2.590610
NY      0.442792  0.573708 -0.561990  0.436353
WY      0.780341  0.481560 -0.002860 -0.002637
OR      0.301389  0.226828  1.888257  0.205828
CO     -1.147226 -0.572476  1.928439 -1.697054

In [51]:
df

          W         X         Y         Z States
A -1.390351 -0.826697 -0.935881 -2.590610     CA
B  0.442792  0.573708 -0.561990  0.436353     NY
C  0.780341  0.481560 -0.002860 -0.002637     WY
D  0.301389  0.226828  1.888257  0.205828     OR
E -1.147226 -0.572476  1.928439 -1.697054     CO